mailing-project/app/controllers/emails_controller.rb

  def index
    @emails = Email.all
---
SELECT "emails".* FROM "emails" ORDER BY "emails"."created_at" ASC

  def create
    @email = Email.new(object: Faker::Book.title, body: Faker::Lorem.paragraph)

    if @email.save
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def show
    @email = Email.find(params[:id])
    @email.update(read: true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-11-19 14:59:02.303978"], ["id", 3]]

  def destroy
    @email = Email.find(params[:id])
    @email.destroy
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 1]]

  def update
    @email = Email.find(params[:id])
    @email.toggle(:read).save
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2020-11-19 15:34:07.717479"], ["id", 23]]